## Pandas - Drop duplicate rows in Pandas based on column value

Sumber : https://www.interviewqs.com/ddi_code_snippets/drop_duplicate_rows_pandas

In [1]:
#memasukan modul yang digunakan
import pandas as pd

In [2]:
#membuat dataFrame
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'], 
            'age': [20, 19, 22, 21], 
            'favorite_color': ['blue', 'blue', 'yellow', "green"],
            'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data, index = ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'])
df

                              name  age favorite_color  grade
Willard Morris      Willard Morris   20           blue     88
Al Jennings            Al Jennings   19           blue     92
Omar Mullins          Omar Mullins   22         yellow     95
Spencer McDaniel  Spencer McDaniel   21          green     70

In [3]:
#menghapus baris yang sama berdasarkan kolom 'favorite_color' dimana keep="first"
df = df.drop_duplicates(subset='favorite_color', keep="first")
df

                              name  age favorite_color  grade
Willard Morris      Willard Morris   20           blue     88
Omar Mullins          Omar Mullins   22         yellow     95
Spencer McDaniel  Spencer McDaniel   21          green     70

                            ##Semoga Bermanfaat
                            ##@Raspiani_